const treeInfo = {
  SOFORA: {
    latinName: "Sophora japonica",
    floweringSeason: "Αύγουστος-Σεπτέμβριος",
    Dimensions: {
      maxHeight: "12-15μ.",
      maxCrownDiameter: "10-12μ.",
    },
    Description:
      "Η σοφόρα είναι φυλλοβόλο δένδρο με σφαιρική κόμη και χαρακτηριστικά πράσινα κλαδιά, με σύνθετα, καταπράσινα φύλλα. Ανθοφορούν μόνο τα ενήλικα φυτά, σχηματίζοντας κρεμάνθη.",
  },

  NERATZIA: {
    latinName: "Citrus aurantium",
    floweringSeason: "Απρίλιος-Ιούνιος",
    Dimensions: {
      maxHeight: "8-10μ.",
      maxCrownDiameter: "4-6μ.",
    },
    Description:
      "Η νεραντζιά είναι αειθαλές, καρποφόρο δένδρο αργής ανάπτυξης με γυαλιστερά φύλλα. Έχει πορτοκαλί καρπούς που ωριμάζουν το φθινόπωρο και αγκαθωτά κλαδιά όπως τη λεμονιά.",
  },

  LIGOUSTRO: {
    latinName: "Ligustrum japonicum",
    floweringSeason: "Μάιος-Ιούνιος",
    Dimensions: {
      maxHeight: "3-4μ.",
      maxCrownDiameter: "1,5-2μ.",
    },
    Description:
      "Το λιγούστρο είναι όρθιος, πολύ ανθεκτικός, αειθαλής θάμνος ή δένδρο. Είναι φυτό κατάλληλο για φράχτες. Έχει μεγάλα, γυαλιστερά, σκουροπράσινα, μακρόστενα φύλλα και παράγει λευκά άνθη. Είναι φυτό αντοχής, χωρίς ιδιαίτερες απαιτήσεις, ενώ αντέχει στην ατμοσφαιρική ρύπανση.",
  },

  KALLOPISTIKI_DAMASKINIA: {
    latinName: "Prunus cerasifera",
    floweringSeason: "Μάρτιος",
    Dimensions: {
      maxHeight: "8-10μ.",
      maxCrownDiameter: "5-6μ.",
    },
    Description:
      "Η καλλωπιστική Δαμασκηνιά είναι ανθεκτικό, φυλλοβόλο δένδρο με σφαιρική κόμη. Έχει κόκκινους νεαρούς βλαστούς και σκούρο, πορφυρό φύλλωμα. Την άνοιξη έχει πολυάριθμα, μικρά, ροζ μπουμπούκια που δίνουν λευκά άνθη.",
  },

  KERLETORIA: {
    latinName: "Koelreuteria paniculata",
    floweringSeason: "Ιούνιος-Ιούλιος",
    Dimensions: {
      maxHeight: "8-12μ",
      maxCrownDiameter: "8μ",
    },
    Description:
      "Η κερλετέρια είναι φυλλοβόλο δένδρο βραδείας ανάπτυξης με σφαιρικό σχήμα. Έχει σύνθετο φύλλωμα και παίρνει κίτρινες αποχρώσεις το φθινόπωρο. Κάνει κατακίτρινα άνθη και οι καρποί του είναι καστανέρυθρες έως κόκκινες διογκωμένες κάψες, που περιέχουν ελάχιστους σπόρους.",
  },

  IVISKOS: {
    latinName: "Hibiscus sinensis",
    floweringSeason: "Μάιος-Οκτώβριος",
    Dimensions: {
      maxHeight: "1,5-2,5μ",
      maxCrownDiameter: "1-1,5μ",
    },
    Description:
      "Ο σινικός ιβίσκος είναι αειθαλής ή ημιαειθαλής, σφαιρικός θάμνος ή δένδρο μεσαίας ανάπτυξης. Έχει σκληρούς βλαστούς, πράσινα, λαμπερά φύλλα και μεγάλα άνθη με διάφορα χρώματα και σχήματα.",
  },

  FLAMOURIA: {
    latinName: "Tilia tomentosa",
    floweringSeason: "Ιούνιος-Ιούλιος",
    Dimensions: {
      maxHeight: "15-20μ.",
      maxCrownDiameter: "8-10μ.",
    },
    Description:
      "Η τιλιά ή φλαμουριά ή φιλύρα είναι φυλλοβόλο δένδρο με συμμετρικό σχήμα. Τα φύλλα του είναι πράσινα από πάνω και αργυρόχρωμα, χνουδωτά από κάτω. Έχει πολυάριθμα, κιτρινωπά, αρωματικά λουλούδια που γεμίζουν το δένδρο κατά την ανθοφορία του, το γνωστό σε όλους τίλιο.",
  },

  AKAKIA: {
    latinName: "Acacia saligna",
    floweringSeason: "Φεβρουάριος-Απρίλιος",
    Dimensions: {
      maxHeight: "5-6μ.",
      maxCrownDiameter: "2-3μ.",
    },
    Description:
      "Η ακακία η κυανόφυλλη είναι αειθαλές, όρθιο δένδρο. Έχει λογχοειδή, πράσινα φύλλα και ανθοφορεί όψιμα με ανοιχτοκίτρινα άνθη.",
  },

  GKINGKO: {
    latinName: "Ginkgo biloba",
    Dimensions: {
      maxHeight: "18-20μ.",
      maxCrownDiameter: "5-6μ.",
    },
    Description:
      "Το Γκίνγκο ανήκει στα κωνοφόρα, αλλά είναι το μόνο που διαφέρει εξωτερικά. Είναι φυλλοβόλο και έχει ανοιχτοπράσινα φύλλα σε σχήμα βεντάλιας, τα οποία θεωρούνται φαρμακευτικά (βοηθούν στη μνήμη) και γίνονται χρυσοκίτρινα το φθινόπωρο πριν πέσουν. Τα πρώτα 10 χρόνια, το ύψος του δεν ξεπερνά τα 2-2,5μ. Έχει αργή ανάπτυξη.",
  },

  YGRAMBARI: {
    latinName: "Liquidambar styraciflua",
    Dimensions: {
      maxHeight: "10-15μ.",
      maxCrownDiameter: "5-6μ.",
    },
    Description:
      "Η λικιδάμβαρη είναι φυλλοβόλο δένδρο με κωνικό σχήμα. Έχει ανοιχτοπράσινα φύλλα με 5-7 λοβούς που παίρνουν διάφορες αποχρώσεις το φθινόπωρο (κίτρινο, κόκκινο, πορτοκαλί, πορφυρό ή μενεξεδί). Ένα από τα χαρακτηριστικά της είναι ο φλοιός του κορμού, που είναι ανάγλυφος και ρυτιδωμένος. Εμφανίζει μικρούς, στρογγυλούς καρπούς με μακρύ μίσχο.",
  },

  MELIA: {
    latinName: "Melia azedarach",
    floweringSeason: "Μάιος-Ιούνιος",
    Dimensions: {
      maxHeight: "10-12μ.",
      maxCrownDiameter: "6-8μ.",
    },
    Description:
      "Η μελιά είναι φυλλοβόλο, σφαιρικό δένδρο με σύνθετα, ανοιχτοπράσινα φύλλα που το φθινόπωρο γίνονται χρυσοκίτρινα. Κάνει αρωματικά μπλε-λιλά άνθη και παράγει μικρούς, σφαιρικούς, κίτρινους καρπούς, που παραμένουν στο δένδρο και το χειμώνα.",
  },

  KELTIS: {
    latinName: "Celtis australis",
    floweringSeason: "Μάρτιος-Απρίλιος",
    Dimensions: {
      maxHeight: "15-20μ.",
      maxCrownDiameter: "8μ.",
    },
    Description:
      "Η κέλτις ή μελικουκιά είναι φυλλοβόλο δένδρο με σφαιρικό σχήμα. Τα φύλλα του είναι επιμήκη, ανάγλυφα και ελαφρώς οδοντωτά με διάσπαρτες άσπρες κηλίδες. Κάνει καρπούς δρύπες που ωριμάζουν Σεπτέμβριο-Οκτώβριο.",
  },

  LIRIODENTRO: {
    latinName: "Liriodendron tulipifera",
    floweringSeason: "Ιούνιος",
    Dimensions: {
      maxHeight: "15-20μ.",
      maxCrownDiameter: "8-10μ.",
    },
    Description:
      "Το λιριόδενδρο είναι φυλλοβόλο δένδρο, μεγαλοπρεπές με πλατύ, κολωνοειδές σχήμα. Έχει μέτρια ταχύτητα ανάπτυξης και είναι ανθεκτικό στο κρύο. Τα φύλλα του είναι ανοιχτοπράσινα, πλατιά και λίγο λοβωτά, που γίνονται φωτεινά, έντονα κίτρινα και καστανοκίτρινα το φθινόπωρο. Ανθοφορούν μόνο τα ενήλικα δένδρα με αρωματικά, πράσινα άνθη, με πορτοκαλί απόχρωση εσωτερικά. Το σχήμα των ανθών μοιάζει με της Τουλίπας.",
  },

  LAGKESTRERMIA: {
    latinName: "Lagerstroemia indica",
    floweringSeason: "Ιούλιος-Σεπτέμβριος",
    Dimensions: {
      maxHeight: "4-5μ.",
      maxCrownDiameter: "3μ.",
    },
    Description:
      "Η Λαγκεστρέμια είναι φυλλοβόλο δένδρο ή θάμνος με ορθόκλαδη ανάπτυξη και λείο, διακοσμητικό κορμό. Έχει βλάστηση με μικρά, στρογγυλά, σύνθετα φυλλάρια που παίρνουν ωραίες, κοκκινωπές αποχρώσεις το φθινόπωρο.",
  },

  ARIA: {
    latinName: "Quercus ilex",
    floweringSeason: "Απρίλιος-Μάιος",
    Dimensions: {
      maxHeight: "15μ.",
      maxCrownDiameter: "6-8μ.",
    },
    Description:
      "Η αριά (λευκή βελανιδιά) είναι αειθαλές είδος δρυός σε μορφή δένδρου ή θαμνόδενδρου, με μεγάλη και αρκετά αργή ανάπτυξη. Έχει σκληρά, ακανθώδη φύλλα με πράσινη, γυαλιστερή επιφάνεια από πάνω και χνουδωτή από κάτω. Την άνοιξη κάνει μικρά κιτρινωπά άνθη και το καλοκαίρι βγάζει βελανίδια που είναι πράσινα όταν είναι ώριμα και καφέ-κόκκινα λίγο πριν πέσουν.",
  },

  PSEUDOAKAKIA: {
    latinName: "Robinia pseudoacacia",
    floweringSeason: "Μάιος",
    Dimensions: {
      maxHeight: "20-30μ.",
      maxCrownDiameter: "10-15μ.",
    },
    Description:
      "Η ροβίνια ή ψευδοακακία είναι φυλλοβόλο δένδρο ταχείας ανάπτυξης με αγκαθωτά κλαδιά και σύνθετο, ανοιχτοπράσινο φύλλωμα που το φθινόπωρο γίνεται κίτρινο. Σχηματίζει μελιτοφόρο ανθοφορία την άνοιξη με λευκά, αρωματικά λουλούδια.",
  },

  AKAKIA_KONSTANTINOUPOLEOS: {
    latinName: "Albizia julibrissin",
    floweringSeason: "Ιούλιος-Αύγουστος",
    Dimensions: {
      maxHeight: "8-10μ.",
      maxCrownDiameter: "7-8μ.",
    },
    Description:
      "Η ακακία Κωνσταντινουπόλεως ή αλβίζια είναι φυλλοβόλο δένδρο με πλαγιόκλαδη, ημισφαιρική κόμη, κατάλληλο για σκιά. Έχει διπλά, σύνθετα, ανοιχτοπράσινα φύλλα και ωραία ροζ ανθοφορία.",
  },

  DENTRODIS_FOTINIA: {
    latinName: "Photinia",
    floweringSeason: "Απρίλιος-Μάιος",
    Dimensions: {
      maxHeight: "4-5μ.",
      maxCrownDiameter: "1.5-2μ.",
    },
    Description:
      "Η δενδρώδης Φωτίνια είναι όρθιος, αειθαλές θάμνος διαμορφωμένος σε δένδρο. Οι νεαροί βλαστοί έχουν έντονο, κόκκινο χρώμα, στη συνέχεια κόκκινο έως βιολετί και στο τέλος γίνονται πράσινοι. Ο ήλιος και η θερμοκρασία επηρεάζουν ανάλογα το χρωματισμό των φύλλων.",
  },

  PLATANOMOURIA: {
    latinName: "Morus alba ‘Pendula’",
    Dimensions: {
      maxHeight: "3-4μ.",
      maxCrownDiameter: "2.5μ.",
    },
    Description:
      "Η κρεμοκλαδής μουριά είναι φυλλοβόλο δένδρο με κρεμοκλαδή μορφή, που επιτυγχάνεται με εμβολιασμό περίπου στα 2μ. Από το σημείο του εμβολιασμού ξεκινούν πολυάριθμοι, λεπτοί, ευθυτενείς βλαστοί που φθάνουν ως το έδαφος. Φέρει καρδιόσχημα φύλλα, μερικές φορές λοβωτά, με φωτεινό, σκουροπράσινο χρώμα που γίνεται κίτρινο το φθινόπωρο.",
  },

  DAFNI: {
    latinName: "Nerium oleander",
    floweringSeason: "Μάιος-Σεπτέμβριος",
    Dimensions: {
      maxHeight: "3-5μ.",
      maxCrownDiameter: "2-3μ.",
    },
    Description:
      "Η Πικροδάφνη είναι αειθαλής θάμνος σφαιρικού σχήματος. Τα φύλλα της είναι πράσινα και επιμήκη. Έχει διπλά ή μονά άνθη διάφορων χρωμάτων, τα οποία σε μερικές ποικιλίες είναι και αρωματικά.",
  },

  KOUTSOPIA: {
    latinName: "Cercis siliquastrum",
    floweringSeason: "Μάρτιος-Απρίλιος",
    Dimensions: {
      maxHeight: "3-4μ.",
      maxCrownDiameter: "2-3μ.",
    },
    Description:
      "Η κουτσουπιά είναι φυλλοβόλο δένδρο ή θάμνος με στρογγυλά, πράσινα-υποκύανα φύλλα σε καρδιόσχημη μορφή. Έχει έντονη, εντυπωσιακή, ροζ-βιολετί ανθοφορία σε όλο το μήκος των βλαστών πριν την έκπτυξη των φύλλων και οι καρποί διατηρούνται και το χειμώνα.",
  },

  SFENDAMOS_PLATANOIDIS: {
    latinName: "Acer platanoides",
    floweringSeason: "Μάρτιος-Απρίλιος",
    Dimensions: {
      maxHeight: "20-30μ.",
      maxCrownDiameter: "10-15μ.",
    },
    Description:
      "Το πλατανοειδές σφενδάμι είναι φυλλοβόλο δένδρο ταχείας ανάπτυξης με σφαιρική κόμη. Έχει ανοιχτοπράσινα φύλλα, γυαλιστερά και πεντάλοβα, που μοιάζουν με του πλάτανου και το φθινόπωρο γίνονται ωχροκίτρινα και πορτοκαλί. Ανθοφορεί σε όρθιους, κίτρινους κόρυμβους την άνοιξη, πριν την έκπτυξη των φύλλων.",
  },

  IPPOKASTANIA: {
    latinName: "Aesculus hippocastanum",
    floweringSeason: "Απρίλιος-Μάιος",
    Dimensions: {
      maxHeight: "20-30μ.",
      maxCrownDiameter: "15-20μ.",
    },
    Description:
      "Η ιπποκαστανιά είναι φυλλοβόλο δένδρο ταχείας ανάπτυξης με σφαιρικό σχήμα. Έχει πράσινο, σύνθετο φύλλωμα με πέντε φυλλάρια, τα οποία είναι 8 έως 15 εκατοστά και γίνονται χρυσοπράσινα το φθινόπωρο. Έχει πλούσια ανθοφορία με όρθιες λευκές φόβες την άνοιξη. Παράγει γυαλιστερούς καρπούς το φθινόπωρο.",
  },
  MANOLIA_DENDRODIS: {
    latinName: "Magnolia grandiflora ‘Gallisoniensis’",
    floweringSeason: "Ιούνιος-Αύγουστος",
    Dimensions: {
      maxHeight: "12-15μ.",
      maxCrownDiameter: "8μ.",
    },
    Description:
      "Η δενδρώδης μανόλια είναι η μόνη αειθαλής μανόλια, η οποία έχει μεγάλα, δερματώδη, γυαλιστερά φύλλα. Τα φύλλα είναι πράσινα στο επάνω μέρος και κοκκινωπά στο κάτω. Ανθοφορεί με πολύ αρωματικά, μεγάλα λουλούδια άσπρο-κρεμ σε σχήμα κυπέλλου το καλοκαίρι. Έχει στρογγυλούς καρπούς και όταν ανοίγουν εμφανίζουν κόκκινους σπόρους.",
  },

  SFENDAMOS_PEDINOS: {
    latinName: "Acer campestre",
    floweringSeason: "Μάρτιος-Απρίλιος",
    Dimensions: {
      maxHeight: "15μ.",
      maxCrownDiameter: "8μ.",
    },
    Description:
      "Ο πεδινός σφένδαμος είναι φυλλοβόλο δένδρο με πράσινο φύλλωμα που εναλλάσσεται χρωματικά με την εποχή αποκτώντας κόκκινους και πορτοκαλοκίτρινους τόνους, λίγο πριν πέσει με την έναρξη του χειμώνα. Τα μικροσκοπικά άνθη του εμφανίζονται την άνοιξη, σε απαλούς πράσινους τόνους. Καθώς όμως ωριμάζουν, δίνουν τη θέση τους σε καρπούς με τη μορφή φτερών, που στολίζουν το φυτό και είναι χαρακτηριστικά όλων των σφενδάμων.",
  },

  SFENDAMI_MONPELIE: {
    latinName: "Acer monspessulanum",
    floweringSeason: "Απρίλιος-Μάιος",
    Dimensions: {
      maxHeight: "15μ.",
      maxCrownDiameter: "5μ.",
    },
    Description:
      "Ο φλοιός είναι λείος, ερυθροκάστανος, στα νεαρά δέντρα, με λεπτές σχισμές, γκριζοκάστανος, στα πιο ώριμα. Τα φύλλα είναι τρίλοβα και τα άνθη ωχροπράσινα. Ο καρπός είναι καστανού-ερυθρού χρώματος.",
  },

  SFENDAMI_PSEUDOPLATANOS: {
    latinName: "Acer pseudoplatanus",
    floweringSeason: "Απρίλιος-Μάιος",
    Dimensions: {
      maxHeight: "18μ.",
      maxCrownDiameter: "5μ.",
    },
    Description:
      "Ο ψευδοπλάτανος σφένδαμος είναι ένα φυλλοβόλο δέντρο με στρογγυλωπό φύλλωμα, που θυμίζει πολύ πλάτανο. Τα φύλλα είναι βαθύ πράσινο χρώμα από την πάνω πλευρά και απαλό πράσινο από την κάτω. Τα μικροσκοπικά άνθη του εμφανίζονται αργά την άνοιξη, σε απαλούς κιτρινοπράσινους τόνους. Καθώς σταδιακά ωριμάζουν, δίνουν τη θέση τους σε πανέμορφους καρπούς, με τη μορφή φτερών.",
  },
  YGRAMBARI_ZITIA: {
    latinName: "Liquidambar orientalis",
    floweringSeason: "Μάρτιος-Απρίλιος",
    Dimensions: {
      maxHeight: "35μ.",
      maxCrownDiameter: "6μ.",
    },
    Description:
      "Η Ζητιά είναι φυλλοβόλο δέντρο με πεντάλοβα πράσινα φύλλα και άνθη κοκκινωπά. Όταν το λουλούδι ωριμάσει, μετατρέπεται σε φραγκόσυκο κώνο και γίνεται γκριζοπράσινο.",
  },

  FRAKSOS: {
    latinName: "Fraxinus ornus",
    floweringSeason: "Απρίλιος-Μάιος",
    Dimensions: {
      maxHeight: "20μ.",
      maxCrownDiameter: "4-8μ",
    },
    Description:
      "Ο φράξος ή μελιάδι είναι ένα φυλλοβόλο δέντρο με ασύμμετρα στρογγυλωπό φύλλωμα, με πράσινους, κίτρινους ή ροζ χρωματισμούς. Από την άνοιξη, ντύνεται με λευκά ανάλαφρα άνθη και αργότερα με χρωματιστούς, κρεμαστούς καρπούς.",
  },

  KYPARISSI_PLAGIOKLADO: {
    latinName: "Cupressus sempervirens var. horizontalis",
    Dimensions: {
      maxHeight: "20-30μ.",
      maxCrownDiameter: "6-8μ",
    },
    Description:
      "Το οριζοντιόκλαδο ή πλαγιόκλαδο κυπαρίσσι είναι κωνοφόρο με ελεύθερο, σχεδόν σχήμα. Αναπτύσσεται σχετικά γρήγορα τα πρώτα 10 χρόνια.",
  },

  KYPARISSI_ORTHOKLADO: {
    latinName: "Cupressus sempervirens ‘Pyramidalis’",
    Dimensions: {
      maxHeight: "15-20μ.",
      maxCrownDiameter: "2-3μ",
    },
    Description:
      "Το ορθόκλαδο κυπαρίσσι είναι κωνοφόρο με στενό, συμμετρικό, κολονοειδές σχήμα που τα πρώτα 10 χρόνια δεν ξεπερνά τα 2,5-3μ. Έχει έντονο, σκούρο πράσινο φύλλωμα.",
  },

  DRYS_PLATOFYFYLLI: {
    latinName: "Quercus frainetto",
    floweringSeason: "Απρίλιος-Μάιος",
    Dimensions: {
      maxHeight: "20-25μ.",
      maxCrownDiameter: "25μ",
    },
    Description:
      "Η πλατύφυλλη δρυς είναι φυλλοβόλο δέντρο με πυκνή ωοειδή μέχρι στρογγυλή κόμη και φλοιό καστανόχρωμο. Η άνω επιφάνεια των φύλλων είναι πράσινη ελαφρά τριχωτή, ενώ η κάτω, ωχρό-πράσινη με πυκνό τρίχωμα. Τα αρσενικά άνθη φύονται σε κρεμάμενους πράσινους ίουλους, στη βάση των ετήσιων βλαστών, ενώ τα θηλυκά φύονται πολλά μαζί σε κοντό και πλατύ ποδίσκο, στην κορυφή των ετήσιων βλαστών.",
  },
  PLATANI: {
    latinName: "Platanus orientalis",
    floweringSeason: "Μάρτιος-Μάιος",
    Dimensions: {
      maxHeight: "≥ 20μ.",
      maxCrownDiameter: "≥ 8μ",
    },
    Description:
      "Η καλλωπιστική του αξία οφείλεται στο χρώμα και το σχήμα των φύλλων του καθώς και στην χρήση του ως δένδρο σκίασης.",
  },
  KALLOPISTIKI_KERASIA: {
    latinName: "Prunus serrulata 'Kanzan'",
    floweringSeason: "Μάρτιος-Απρίλιος",
    Dimensions: {
      maxHeight: "8-12μ.",
      maxCrownDiameter: "≥ 8μ",
    },
    Description:
      "Μετρίου μεγέθους φυλλοβόλο δένδρο υψηλής καλλωπιστικής αξίας, με χαλκινο-βυσσινι χρώματος φύλλα και ροζ-μωβ όμορφα άνθη.",
  },
  AGRIOSORVIA: {
    latinName: "Sorbus aucuparia",
    floweringSeason: "Μάιος-Ιούνιος",
    Dimensions: {
      maxHeight: "12-20μ.",
      maxCrownDiameter: "4-8μ",
    },
    Description:
      "Η Sorbus aucuparia είναι ένα μεσαίου μεγέθους φυλλοβόλο δένδρο της οικογένεια των  Rosaceae, με ύψος 10-20 μέτρα, με στρογγυλή και αραιά κόμη, με μπουμπούκια που ξεκινούν τριχωτά και γίνονται λεία αργότερα. Τα μικρά άνθη της είναι λευκό-κίτρινα σε ταξιανθίες κόρυμβους και εμφανίζονται από το Μάιο έως και τον Ιούνιο.",
  },
};

export const typeToTreeInfoMap = new Map([
  ["Σοφόρα", treeInfo.SOFORA],
  ["Νεραντζιά", treeInfo.NERATZIA],
  ["Λιγούστρο", treeInfo.LIGOUSTRO],
  ["Καλλωπιστική Δαμασκηνιά", treeInfo.KALLOPISTIKI_DAMASKINIA],
  ["Κερλετόρια", treeInfo.KERLETORIA],
  ["Ιβίσκος", treeInfo.IVISKOS],
  ["Φλαμουριά", treeInfo.FLAMOURIA],
  ["Ακακία", treeInfo.AKAKIA],
  ["Γκίνγκο", treeInfo.GKINGKO],
  ["Υγράμβαρη", treeInfo.YGRAMBARI],
  ["Μελιά", treeInfo.MELIA],
  ["Κέλτις", treeInfo.KELTIS],
  ["Λιριόδεντρο", treeInfo.LIRIODENTRO],
  ["Λαγκεστρέμια", treeInfo.LAGKESTRERMIA],
  ["Αριά", treeInfo.ARIA],
  ["Ψευδοακακία", treeInfo.PSEUDOAKAKIA],
  ["Aκακία Κωνσταντινουπόλεως", treeInfo.AKAKIA_KONSTANTINOUPOLEOS],
  ["Δενδρώδης φωτίνια", treeInfo.DENTRODIS_FOTINIA],
  ["Πλατανομουριά", treeInfo.PLATANOMOURIA],
  ["Δάφνη", treeInfo.DAFNI],
  ["Κουτσουπιά", treeInfo.KOUTSOPIA],
  ["Σφένδαμος ο πλατανοειδής", treeInfo.SFENDAMOS_PLATANOIDIS],
  ["Ιπποκαστανιά", treeInfo.IPPOKASTANIA],
  ["Μανόλια δενδρώδης", treeInfo.MANOLIA_DENDRODIS],
  ["Σφένδαμος πεδινός", treeInfo.SFENDAMOS_PEDINOS],
  ["Σφενδάμι του Μονπελιέ", treeInfo.SFENDAMI_MONPELIE],
  ["Σφενδάμι ψευδοπλάτανος", treeInfo.SFENDAMI_PSEUDOPLATANOS],
  // ["Υγράμβαρη", treeInfo.YGRAMBARI_ZITIA],
  ["Φράξος", treeInfo.FRAKSOS],
  ["Κυπαρίσσι πλαγιόκλαδο", treeInfo.KYPARISSI_PLAGIOKLADO],
  ["Κυπαρίσσι ορθόκλαδο", treeInfo.KYPARISSI_ORTHOKLADO],
  ["Δρυς πλατύφυλλη", treeInfo.DRYS_PLATOFYFYLLI],
  ["Πλατάνι", treeInfo.PLATANI],
  ["Καλλωπιστική Κερασιά", treeInfo.KALLOPISTIKI_KERASIA],
  ["Αγριοσορβιά", treeInfo.AGRIOSORVIA],
]);
